#include<stdio.h>
int sm2tc(int x) {

  int sign=(x>>31)&0x1;
  printf("sign %d\n",sign);
  int mask=sign<<30>>30;//负数为0x7FFFFFFF,正数为0x00000000
  printf("mask %d\n",mask);
  printf("x^mask %d\n",x^mask);
  int absx=x^mask+1&sign;//负数按位取反，正数为原来的值;负数加1，正数加0;得到补码;
  //如果是负数，则符号位也变为0了，需要变回来，正数没关系
  printf("1&sign %d\n",1&sign);
  printf("x^mask+1&sign %d\n",x^mask+1&sign);
  return absx;

}
int main(){
    printf("%d\n\n",sm2tc(0x80000000));
}
/*
测试 sm2tc(-2147483648[0x80000000]) 失败！
  计算得到 -2147483648[0x80000000].  应该是 0[0x0]  
测试 sm2tc(-3[0xfffffffd]) 失败！
  计算得到 -3[0xfffffffd].  应该是 -2147483645[0x80000003]
测试 sm2tc(-533151630[0xe038c072]) 失败！
  计算得到 -533151630[0xe038c072].  应该是 -1614332018[0x9fc73f8e]
测试 sm2tc(-2147483647[0x80000001]) 失败！
  计算得到 -2147483647[0x80000001].  应该是 -1[0xffffffff]
测试 sm2tc(-2[0xfffffffe]) 失败！
  计算得到 -2[0xfffffffe].  应该是 -2147483646[0x80000002]
测试 sm2tc(-1749667987[0x97b62f6d]) 失败！
  计算得到 -1749667987[0x97b62f6d].  应该是 -397815661[0xe849d093]
测试 sm2tc(-2147483646[0x80000002]) 失败！
  计算得到 -2147483646[0x80000002].  应该是 -2[0xfffffffe]
测试 sm2tc(-1[0xffffffff]) 失败！
  计算得到 -1[0xffffffff].  应该是 -2147483647[0x80000001]
测试 sm2tc(-2147483645[0x80000003]) 失败！
  计算得到 -2147483645[0x80000003].  应该是 -3[0xfffffffd]
测试 sm2tc(-1906041655[0x8e641cc9]) 失败！
  计算得到 -1906041655[0x8e641cc9].  应该是 -241441993[0xf19be337]
测试 sm2tc(-2147483644[0x80000004]) 失败！
  计算得到 -2147483644[0x80000004].  应该是 -4[0xfffffffc]
测试 sm2tc(-2109733759[0x82400481]) 失败！
  计算得到 -2109733759[0x82400481].  应该是 -37749889[0xfdbffb7f]
*/